micropython/micropython/ports/stm32/main.c
    return true;
}
#endif

#if MICROPY_HW_SDCARD_MOUNT_AT_BOOT
static bool init_sdcard_fs(void) {
    bool first_part = true;
    for (int part_num = 1; part_num <= 5; ++part_num) {
        // create vfs object
        fs_user_mount_t *vfs_fat = m_new_obj_maybe(fs_user_mount_t);
        mp_vfs_mount_t *vfs = m_new_obj_maybe(mp_vfs_mount_t);
        if (vfs == NULL || vfs_fat == NULL) {
            break;
        }
        vfs_fat->blockdev.flags = MP_BLOCKDEV_FLAG_FREE_OBJ;
        if (part_num == 5) {
            if (!first_part) {
                break;
            }
            // partitions 1-4 couldn't be mounted, so try FATFS auto-detect mode
            // which will work if there is no partition table, just a filesystem
            sdcard_init_vfs(vfs_fat, 0);
        } else {
            sdcard_init_vfs(vfs_fat, part_num);
        }

        // try to mount the partition
        FRESULT res = f_mount(&vfs_fat->fatfs);

        if (res != FR_OK) {
            // couldn't mount
            m_del_obj(fs_user_mount_t, vfs_fat);
            m_del_obj(mp_vfs_mount_t, vfs);
        } else {
            // mounted via FatFs, now mount the SD partition in the VFS
            if (first_part) {
                // the first available partition is traditionally called "sd" for simplicity
                vfs->str = "/sd";
                vfs->len = 3;
            } else {
                // subsequent partitions are numbered by their index in the partition table
                if (part_num == 2) {
                    vfs->str = "/sd2";
                } else if (part_num == 3) {
                    vfs->str = "/sd3";
                } else {
                    vfs->str = "/sd4";
                }
                vfs->len = 4;
            }
            vfs->obj = MP_OBJ_FROM_PTR(vfs_fat);
            vfs->next = NULL;
            for (mp_vfs_mount_t **m = &MP_STATE_VM(vfs_mount_table);; m = &(*m)->next) {
                if (*m == NULL) {
                    *m = vfs;
                    break;
                }
            }

            #if MICROPY_HW_ENABLE_USB
            if (pyb_usb_storage_medium == PYB_USB_STORAGE_MEDIUM_NONE) {
                // if no USB MSC medium is selected then use the SD card
                pyb_usb_storage_medium = PYB_USB_STORAGE_MEDIUM_SDCARD;
            }
            #endif

            #if MICROPY_HW_ENABLE_USB
            // only use SD card as current directory if that's what the USB medium is
            if (pyb_usb_storage_medium == PYB_USB_STORAGE_MEDIUM_SDCARD)
            #endif
            {
                if (first_part) {
                    // use SD card as current directory
                    MP_STATE_PORT(vfs_cur) = vfs;
                }
            }
            first_part = false;
        }
    }

    if (first_part) {
        mp_printf(&mp_plat_print, "MPY: can't mount SD card\n");
        return false;
    } else {
        return true;
    }
}
#endif

#if defined(STM32N6)
#include "xspi.h"
void Reset_Handler(void);
void iram_bootloader_reset(void) {
    #if 0
    // LED_GREEN = pa7
    // LED_BLUE = pb1
    // LED_RED = pg10
    LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOA);
    LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOB);
    LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOG);
    GPIOA->MODER = 1 << (2 * 7);
    GPIOB->MODER = 1 << (2 * 1);
    GPIOG->MODER = 1 << (2 * 10);
    GPIOA->BSRR = 1 << 7;
    GPIOB->BSRR = 1 << 1;
    GPIOG->BSRR = 1 << 10;
    for (int i = 0; i < 5; ++i) {
        GPIOA->BSRR = 0x10000 << 7;
        for (int i = 0; i < 1000000; ++i) {
            __NOP();
        }
        GPIOA->BSRR = 1 << 7;
        for (int i = 0; i < 1000000; ++i) {
            __NOP();
        }
    }
    #endif

    MICROPY_BOARD_LEAVE_STANDBY();
    xspi_init();
    Reset_Handler();
}

// Very simple ARM vector table.
const uint32_t iram_bootloader_isr_vector[] = {
    (uint32_t)&_estack,
    (uint32_t)&iram_bootloader_reset,
};
#endif

#if defined(STM32N6)
static void RISAF_Config(void) {
    RIMC_MasterConfig_t RIMC_master = {0};

    __HAL_RCC_RIFSC_CLK_ENABLE();
    LL_AHB3_GRP1_EnableClockLowPower(LL_AHB3_GRP1_PERIPH_RIFSC | LL_AHB3_GRP1_PERIPH_RISAF);

    RIMC_master.MasterCID = RIF_CID_1;
    RIMC_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;

    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_SDMMC1, &RIMC_master);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_SDMMC1, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_SDMMC2, &RIMC_master);
    HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_SDMMC2, RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
}
#endif

void stm32_main(uint32_t reset_mode) {
    // Low-level MCU initialisation.
    stm32_system_init();

    // Set VTOR, the location of the interrupt vector table.
    // On N6, SystemInit does this, setting VTOR to &g_pfnVectors.
    #if !defined(STM32F0) && !defined(STM32N6)
    #if MICROPY_HW_ENABLE_ISR_UART_FLASH_FUNCS_IN_RAM
    // Copy IRQ vector table to RAM and point VTOR there
    extern uint32_t __isr_vector_flash_addr, __isr_vector_ram_start, __isr_vector_ram_end;
    size_t __isr_vector_size = (&__isr_vector_ram_end - &__isr_vector_ram_start) * sizeof(uint32_t);
    memcpy(&__isr_vector_ram_start, &__isr_vector_flash_addr, __isr_vector_size);
    SCB->VTOR = (uint32_t)&__isr_vector_ram_start;
    #else
    #if defined(MICROPY_HW_VTOR)
    // Change IRQ vector table if configured differently
    SCB->VTOR = MICROPY_HW_VTOR;
    #endif
    #endif
    #endif

    #if __CORTEX_M != 33 && __CORTEX_M != 55
    // Enable 8-byte stack alignment for IRQ handlers, in accord with EABI
    SCB->CCR |= SCB_CCR_STKALIGN_Msk;
    #endif

    // Hook for a board to run code at start up, for example check if a
    // bootloader should be entered instead of the main application.
    MICROPY_BOARD_STARTUP();

    // Enable caches and prefetch buffers

    #if defined(STM32F4)

